Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/time_limitations.html.txt.tmx
Source language: en
Languages: ga

source: Time limitations for the commencement of criminal proceedings
ga: Teorainneacha ama chun imeachtaí coiriúla a thosú

source: There are certain rules which apply to the maximum length of time allowed between the date of an offence and the date by which the Gardaí must commence criminal proceedings
ga: Tá rialacha áirithe a bhaineann leis an uasthréimhse ama a cheadaítear idir an dáta a rinneadh coir agus an dáta deiridh ar féidir leis na Gardaí tús a chur le himeachtaí coiriúla

source: If such limits did not exist and you were accused of an offence, you might have the offence hanging over you indefinitely, not knowing if the Gardaí were going to prosecute you or not
ga: Mura raibh a leithéidí seo de theorainneacha ann agus gur cuireadh coir i do leith, d'fhéadfadh go mbeadh an choir seo ag cur isteach ort ar feadh tréimhse gan deireadh, agus gan fhios agat an raibh na Gardaí chun tú a ionchúiseamh nó nach raibh

source: In the case of a summary offence (an offence tried in the District Court before a judge without a jury) the Gardaí must make a complaint to the District Court within six months of the offence being committed
ga: I gcás ciona achomair (cion a triaileadh sa Chúirt Dúiche os comhair bhreitheamh gan aon giúiré) ní mór do na Gardaí gearán a dhéanamh leis an gCúirt Dúiche taobh istigh de sé mhí den chion a bheith déanta

source: These offences include most Road Traffic Offences like speeding, illegal parking and fixed charge notice offences
ga: I measc na gcionta seo tá formhór Cionta Tráchta ar Bhóithre ar nós ró-luas, pairceáil neamhdhleathach agus cionta fógra muirir sheasta

source: Section 7 of the Criminal Justice Act 1951 (as amended by Section 177 of the Criminal Justice Act 2006) states that the time limits that are provided for summary offences do not apply to an indictable offence that can be tried summarily (an indictable offence is tried by a judge and jury in the Circuit Court or the Central Criminal Court)
ga: Deir Alt 7 den Acht um Cheartas Coiriúil 1951 (arna leasú ag Alt 177 den Acht um Cheartas Coiriúil 2006) nach mbaineann na teorainneacha ama a chuirtear ar fáil i gcomhair cionta achomair le cion indíotáilte is féidir a thriail go hachomair (tá an chion indíotáilte le triail ag breitheamh agus giúiré sa Chúirt Chuarda nó sa Phríomh-Chúirt Choiriúil)

source: Technically, therefore, there is no time limit for the commencement of proceedings in the case of an indictable offence unless specific legislation provides one
ga: Go teicniúil, dá bhrí sin, níl aon teorainn ama ar thús a chur le himeachtaí i gcás chion indíotáilte mura gcuireann reachtaíocht ar leith ceann ar fáil

source: However, if there is an excessively long delay in prosecuting an offence, the judge may decide not to hear the case
ga: Má tá moill rófhada ann ag ionchúiseamh ciona, áfach, is féidir leis an mbreitheamh cinneadh a dhéanamh gan an cás a éisteacht

source: In making the decision, the judge considers whether the delay has reduced your chances of a fair trial, for example, if the delay means that key witnesses are no longer available to give evidence or if the delay could have affected their memory of what happened
ga: Nuair atá an cinneadh seo á dhéanamh aige/aici, tógann an breitheamh san áireamh an baol go laghdódh an mhoill an seans atá agat triail chóir a fháil, mar shampla má chiallaíonn an mhoill nach bhfuil fáil ar phríomh fhinnéithe níos mó chun fianaise a thabhairt nó dá bhféadfadh an mhoill cur isteach ar an gcuimhne a bhí acu den méid a tharla

source: The general time limit of 6 months for commencing proceedings, mentioned above, applies to most offences which are dealt with in the District Court
ga: Baineann an teorainn ama ginearálta de 6 mhí chun tús a chur le himeachtai, a luadh thuas, le formhór cionta a láimhseáiltear sa Chúirt Dúiche

source: There are however, some exceptions to this
ga: Tá eisceachtaí áirithe leis seo, áfach

source: Because of the nature and difficulty of investigating some offences and of gathering enough evidence to start proceedings, special time limits are applied to them by law
ga: Mar gheall ar chineál agus deacracht imscrúdaithe i gcás chionta ar leith agus dóthain fianaise a bhailiú chun tús a chur le himeachtaí, baineann teorainneacha ama speisialta leo faoin dlí

source: Examples of these offences include the following:
ga: Seo a leanas samplaí de na cionta sin:

source: • Under the Wireless Telegraphy Acts, An Post may institute proceedings for unlicensed TV sets at any time within 12 months from the date of the offence
ga: • Faoi na hAchtanna Raidio-Thelegrafaíochta, is féidir le An Post tús a chur le himeachtaí i gcomhair teilifiseáin gan ceadúnas ag tréimhse ar bith taobh istigh de 12 mhí ó dháta an chiona

source: • Under the Housing (Miscellaneous Provisions) Act 1992 proceedings for an offence may be instituted within 2 years from the date of the offence
ga: • Faoi Acht na dTithe (Forálacha Ilghnéitheacha) 1992 is féidir tús a chur le himeachtaí maidir le cion ag tréimhse ar bith taobh istigh de 2 bhliain ó dháta an chiona

source: • For offences under the Revenue Acts, proceedings may commence within 10 years from the date of the offence
ga: • I gcás cionta faoi na hAchtanna Ioncaim, is féidir tús a chur le himeachtai taobh istigh de 10 mbliana ó dháta an chiona

source: • For offences under the Customs Acts, proceedings may commence within 3 years from the date of the offence
ga: • I gcomhair cionta faoi na hAchtanna Custaim, is féidir tús a chur le himeachtaí taobh istigh de 3 bliana ó dháta an chiona

source: Normally, if you receive a summons and you seek legal advice, your solicitor checks the dates on the summons to make sure that the summons was applied for by the Garda within the time limit allowed
ga: Go hiondúil, má fhaigheann tú toghairm agus go lorgaíonn tú comhairle dlí, seiceálann do dhlíodóir na dátaí ar an toghairm chun a chinntiú gur chuir na Gardaí isteach ar an toghairm taobh istigh den teorainn ama atá ceadaithe

source: If the application was made outside the time limit, then the prosecution will be struck down in court
ga: Má rinneadh an t-iarratas taobh amuigh den teorainn ama, caithfear an cás amach as an gcúirt

source: The crucial date is the date the Gardaí make the complaint to the District Court judge or the date they make the application to the appropriate court clerk for the issue of a summons, rather than the date the summons was issued on or the date on which the summons was served on you
ga: Is é an dáta ríthábhachtach ná an dáta a ndéanann na Gardaí an gearán le breitheamh na Cúirte Dúiche nó an dáta a ndéanann siad iarratas chuig an gcléireach cúirte cuí chun toghairm a eisiúint, seachas an dáta ar eisíodh an toghairm ná an dáta ar seirbheáladh an toghairm ortsa

source: The other crucial date is the date the offence took place
ga: Is é an dáta ríthábhachtach eile ná an dáta a rinneadh an cion

source: In most cases this is usually very clear, such as in a case of speeding or theft
ga: I bhformhór cásanna, bíonn sé seo an-soiléir, mar shampla i gcás tiomána ró-thapa nó gadaíochta

source: There are, however, certain offences which are slightly different
ga: Tá ciontaí áirithe atá beagán difriúil, áfach

source: An example of this would be where you are stopped by the Gardaí while driving on 1 January and you are asked for your motor insurance certificate
ga: Sampla de seo ná nuair a stopann na Gardaí tú agus tú ag tiomáint ar an 1 Eanáir agus go n-iarrtar do theastas mótarárachais ort

source: If you do not produce it there and then, you have 10 days in which to produce it at a Garda station of your choice
ga: Mura dtaispeánann tú láithreach bonn é, tá 10 lá agat chun é a thabhairt isteach chuig stáisiún Garda ar bith de do rogha féin

source: If you fail to produce it within 10 days then you have committed an offence
ga: Má theipeann ort é a thabhairt i láthair taobh istigh de 10 lá ansin tá cion déanta agat

source: The offence is not complete until after the expiry of the 10 days and the date you were stopped does not count as one of the 10 days
ga: Níl an cion seo curtha i gcrích go dtí tar éis dhul in éag an tréimhse 10 lá seo, agus ní bhíonn an lá a stopadh tú á chomhaireamh mar cheann den 10 lá seo

source: Therefore, in this case 12 January would be the crucial date
ga: Mar sin, sa chás seo is é an 12 Eanáir an dáta ríthábhachtach
